Repository: ahmdaeyz/currency_converter
Catalog: lib/l10n/intl_*.arb
Languages: ar

# appName
source: Currency Converter
ar: محول العملات

source: Currencies
ar: العملات

source: Currency Converter
ar: محول العملات

source: Converter
ar: المحول

# internetError
source: Please check your internet connection
ar: من فضلك تفقد اتصالك بالانترنت

# contentError
source: Not found.
ar: لا يوجد محتوى

source: Something is wrong.
ar: هناك خطب ما.

# forbiddenAccessError
source: Forbidden access.
ar: غير مسموح

source: Service error.
ar: عطل في الخدمة.

# nothingSelected
source: Please make sure you have to chosen the base and target currencies
ar: من فضلك تأكد من اختيار العملة الاساسية و المحول لها

# noBaseSelected
source: Please make sure you have to chosen the base currency
ar: من فضلك تأكد من اختيار العملة الاساسية

# noToSelected
source: Please make sure you have to chosen the target currency
ar: من فضلك تأكد من اختيار العملة المحول لها

# invalidAmount
source: Inputted amount is invalid
ar: المبلغ المدخل غير صالح

source: Convert
ar: حوّل

# amountHint
source: Amount
ar: المبلغ

source: Base currency
ar: العملة الاساسية

source: Target currency
ar: العملة المحوّل إليها

# invalidEqualSelection
source: Please make sure chosen currencies are different
ar: من فضلك تأكد ان العملات المختارة مختلفة

source: Settings
ar: الاعدادات

source: Language
ar: اللغة

source: Common
ar: عامة

# appLanguage
source: English
ar: العربية

source: Historical Data
ar: البيانات التاريخية

# historicalDataBaseCurrency
source: Base Currency
ar: العملة الاساسية

# errorGettingBaseCurrency
source: Something went wrong, Try changing the base currency from Settings
ar: حدث خطأ ما، حاول تغيير العملة الاساسية من الاعدادات

source: Last Seven days
ar: آخر سبعة أيام

# canNotShowHistoricalDataForBase
source: Historical data can't be display for a currency if it is the base currency
ar: لا يمكن عرض البيانات التاريخية اذا كانت العملة هي العملة الاساسية
